from aiogram import Dispatcher, types


def register_start_handler(dp: Dispatcher):
    dp.register_message_handler(start, commands=['start'], state='*')


async def start(message: types.Message):
    text = "Добро пожаловать!" \
           "\n\n" \
           "Данный бот упростит вам взаимодействие с основными олимпиадами и конкурсами, которые проходят в в «школе " \
           "1210»" \
           "\n\n" \
           "Бот самостоятельно будет отслеживать все олимпиады по интересующим вас предметам, позволит " \
           "выбрать олимпиаду за класс старше, выдать вам ключ без участия классного руководителя, напомнит о начале " \
           "и завершении олимпиад, позволит задать вопросы ответственному за данное направление." \
           "\n\n" \
           "Все основные функции собраны в команде {}. Если возникнут какие-то вопросы, в любой момент можно " \
           "воспользоваться {}, все состояния данного бота сбрасываются при отправке 'отмена', {}, или вызова {}." \
           "\n\n" \
           "Надеемся, это поможет вам активно принимать участие в олимпиадном движении.".format('/menu', '/help',
                                                                                                '/cancel', '/menu')
    await message.answer(text=text)
