from aiogram import Dispatcher, types


def register_start_handler(dp: Dispatcher):
    dp.register_message_handler(start, commands=['start'], state='*')


async def start(message: types.Message):
    text = "Добро пожаловать!" \
           "\n\n" \
           "Данный бот упростит вам взаимодействие в основными олимпиадами и конкурсами, которые проходят в этой " \
           "школе." \
           "\n\n" \
           "Он самостоятельно будет отслеживать все олимпиады по интересующим вас предметам, позволит при желании " \
           "выбрать олимпиаду за класс старше, выдать вам ключ без участия классного руководителя, напомнит и начале " \
           "и завершении олимпиад и позволит задать вопросы напрямую ответственному за данное направление." \
           "\n\n" \
           "Все основные функции собраны в команде {}, если что-то вам не понятно, в любой момент можете " \
           "воспользоваться {}, все состояния данного бота сбрасываются при отправке 'отмена', {}, или вызова {}." \
           "\n\n" \
           "Надеемся, это поможет вам в олимпиадном движении.".format('/menu', '/help', '/cancel', '/menu')
    await message.answer(text=text)
